<template>
	<article>
		<h1>仕組み</h1>
		<p>
			本サーバーでは、<a href="https://geysermc.org/">GeyserMC</a>および<a href="https://github.com/GeyserMC/Floodgate">Floodgate</a>という2つのプラグインを用いて、
			本来はJava版のマインクラフトでしか参加できないマルチプレイサーバーに、統合版のユーザーも参加できるよう拡張を施しています。
		</p>
		<h2>GeyserMCとは？</h2>
		<p>GeyserMCは、統合版とJava版のマインクラフト間で異なる通信プロトコルを仲介するプロキシプラグインです。</p>
		<p>
			通常、マルチプレイ対応のゲームは、サーバーとクライアントという2つの役割を持ったソフトウェアに分かれています。
			クライアントは皆さんがお持ちのマインクラフトそのものです。
			このクライアントが、サーバーという遠くにあるコンピューターに接続するようになっており、
			同じサーバーに接続しているクライアント同士で、共に同じワールドでゲームを楽しむことができます。
		</p>
		<p>
			サーバーとクライアントは、お互いに共通の言葉で会話をすることでマルチプレイを実現します。これをプロトコルと呼びます。
			サーバーとクライアントが異なるプロトコルを使う場合、通信は行なえません。日本人とアメリカ人がそのまま、お互いの言語で会話をしようとしてもできないのと同じです。
		</p>
		<p>
			Java版と統合版は一見同じマインクラフトのように見えますが、実はプロトコルが大きく異なるため、通信ができないのです。
			<strong>そこでGeyserMCの出番です。</strong>
			GeyserMCを間に挟むと、統合版のクライアントが送受信するプロトコルをGeyserMCが通訳するようになっています。これにより、統合版でもJava版のサーバーにアクセスできるのです。
		</p>
		<h2>Floodgateとは？</h2>
		<p>
			Floodgateは、統合版クライアントに限り、Minecraftの認証機構をスキップするプラグインです。
		</p>
		<p>
			通常、Java版のサーバーはクライアントがちゃんと購入されたアカウントであるかどうかを検証するようになっています。これがMinecraftの認証機構なのですが、
			本サーバーのように特殊なユーザーが存在できなくなってしまう問題が同時に起こってしまうのです。これを回避するため、GeyserMC単体ではJava版のアカウントによる追加ログインが必要となってしまいます。
		</p>
		<p>
			しかし、Floodgateを使用することで、統合版クライアントを検知した場合、認証機構をスキップすることができます。これにより統合版のみオフラインアカウントのような挙動を実現しています。

			統合版でマルチプレイをする場合はXboxアカウントが必須になります。
		</p>
	</article>
</template>

<script lang="ts">
import { useHead } from '@vueuse/head';
import { defineComponent } from 'vue';
export default defineComponent({
	name: 'HowItWorks',
	setup() {
		useHead({
			title: '仕組み - XelticaMC'
		});
	},
})
</script>
