<template>
  <h2>ルール</h2>
  <p>本サーバーでは誰もが自由に遊ぶことができます。しかし、大勢の人が気持ちよく遊ぶためには、いくつかの決まりごとを守っていただく必要があります。</p>
  <h3>注意事項</h3>
  <ul>
      <li>チャットで喧嘩しないこと。喧嘩を見つけ次第、その当事者ごと<strong>5分間BAN</strong>とします。頭を冷やしてください。</li>
      <li>意図的にワールドを荒らさないこと。荒らしを見つけ次第、程度によって厳重注意から永久BANまでありえます。</li>
      <li>
        サーバーに過度な負荷をかけないこと。多くの場合（TTの作成やレッドストーンの動作など）はこれに該当することはありません。
        しかし、殆どのユーザーがアクセスすらままならなくなるような負荷を悪意を持ってかけていることが確認された場合、永久BANとします。
      </li>
      <li>持ち物はしっかり管理すること。</li>
  </ul>
  <h3>MODについて</h3>
  <p>
    XelticaMCでは、ゲームプレイを支援するクライアントMOD、リソースパックなどの導入を許可しています。
    しかし、X-RayやForgeHaxなどに代表されるような所謂チート系MODは一切の使用を禁止します。
  </p>
  <p>参考のために、導入を許可する基準にあたるMODをいくつか紹介します。</p>
  <ul>
    <li>Optifine</li>
    <li>IntelliInput / CocoaInput</li>
    <li>VoxelMap</li>
    <li>Inventory Tweaks</li>
    <li>Just Enough Items</li>
  </ul>
  <p>ここに例示していないMODでも許可していることがあります。もし不安でしたら、サーバー管理者に直接お問い合わせください。</p>
  <h3>チャットについて</h3>
  <p>ゲーム内チャットにて、以下のような発言を行うことは禁止されます。度重なる違反がありましたら、モデレーターによる警告を行います。再三の警告にも係わらず従わない場合は、BAN処分と致します。</p>
  <ol>
    <li>反社会的勢力や宗教団体等の宣伝</li>
    <li>現実での出会いを持ちかける発言</li>
    <li>無意味な文字列の発言を繰り返すこと</li>
    <li>不必要に繰り返し発言すること</li>
    <li>1., 2. に該当するウェブサイトのURLの共有</li>
    <li>喧嘩</li>
    <li>特定ユーザーへの誹謗中傷</li>
    <li>その他、運営によって不適切とされる発言</li>
  </ol>
  <h3>更新</h3>
  <ul>
    <li>2021/1/20 チャットに関するルールを追加</li>
    <li>2021/1/17 初版</li>
  </ul>
</template>

<script lang="ts">
import { defineComponent } from 'vue';
export default defineComponent({
  name: 'Rules',
})
</script>

