<template>
	<Markdown :text="body"/>
</template>

<script lang="ts">
import { defineComponent } from 'vue';

import Markdown from '../components/Markdown.vue';

const body = `
## ルール

本サーバーでは誰もが自由に遊ぶことができます。
しかし、大勢の人が気持ちよく遊ぶためには、いくつかの決まりごとを守っていただく必要があります。

**規約に違反した場合、BAN(=サーバーへのアクセスを禁止する処罰)される可能性があります。**

### 注意事項

以下に反する場合、運営による審査のもと処罰が下されます。処罰には厳重注意や没収、権限の剥奪、期限付きBAN、永久BANなどがあります。

- 意図的にワールドを荒らしてはいけません。
- サーバーが機能不全に陥るほどの負荷をかけてはいけません。
- プラグインや権限設定、その他あらゆる場面で不具合を発見した場合は、運営宛てになるべく迅速な報告をお願いします。
  - 不具合の悪用については、常軌を逸すると判断された場合はBAN処分と致します。
  - なお不具合発見者による必要範囲内での不具合の再現についてはこの限りではありません。
- 他ユーザーのアイテムを断りなく盗んではいけません。
- 共有拠点内の施設や、共有の畑など、共有資産である旨が明記されているアイテムや施設は自由に使っても構いませんが、個人の利益の為に独占してはいけません。

### チャットについて

ゲーム内チャットにて、以下のような発言を行うことは禁止されます。度重なる違反がありましたら、モデレーターによる警告を行います。
再三の警告にも係わらず従わない場合は、BAN処分と致します。

1.  反社会的勢力や宗教団体等の宣伝
2.  現実での出会いを持ちかける発言
3.  無意味な文字列の発言を繰り返すこと
4.  不必要に繰り返し発言すること
5.  1., 2. に該当するウェブサイトのURLの共有
6.  喧嘩
7.  特定ユーザーへの誹謗中傷
8.  その他、運営によって不適切とされる発言

### MODについて

XelticaMCでは、ゲームプレイを支援するクライアントMOD、リソースパックなどの導入を許可しています。
しかし、以下に示すようなMODは一切の使用を禁止します。

- Xray などの、一部ブロックのみを透けて見えるようにするMOD
- 飛行MOD
- ノックバックを防止するMOD
- オートエイムMOD
- 連射ツール
- その他、一般的にチートと判断されるMOD

以下のようなMODは使用を許可しています。

- パフォーマンス改善MOD, 影MOD
- マップMOD(洞窟マップもOK)
- インベントリ整理MOD
- レシピ確認MOD
- スポーンチェッカーMOD
- HUD追加MOD

場合によっては、お使いのMODがチートとみなされる可能性があります。もし不安でしたら、Discordにて直接お問い合わせください。

### 配信について

XelticaMC では基本的にYouTube Liveを初めとしたライブ配信サービスでの生配信や、動画配信などを黙認しています。サーバーに参加している他のユーザーに対し必ず許可を取るようお願いします。
また、配信による収益化についても特に禁止していません。

なお、それらの配信については、非公式であるという旨を必ず示すようお願いします。配信に関わるトラブルについて、XelticaMCは一切の責任を負いかねます。

### 免責事項

サーバー内で起きたトラブルについて、XelticaMC モデレーターチームはなるべく対応を試みますが、一切の責任を負いかねるものとします。

また、本サービスは事前の予告無しに急遽変更、終了する可能性があります。

本ルールは事前の予告無しに変更する場合があります。

### 更新

* 2021/1/24 大きく改訂
* 2021/1/20 チャットに関するルールを追加
* 2021/1/17 初版
`;

export default defineComponent({
	name: 'Rules',
	components: {
		Markdown,
	},
	data() {
		return {
			body,
		}
	},
})
</script>
